---
kind: property
id: P:Autodesk.Revit.DB.FamilyParameter.IsReadOnly
source: html/6b0b29c8-dc62-4dd3-b810-08fdc8d48508.htm
---
# Autodesk.Revit.DB.FamilyParameter.IsReadOnly Property

Identifies if the object is read-only or modifiable.

## Syntax (C#)
```csharp
public override bool IsReadOnly { get; }
```